package main

import (
	"fmt"
	"testing"
	"time"
)

func Test_插入一条数据(t *testing.T) {
	var userInfo = X记账{
		X姓名: "张三", X名称: "a1", X年龄: 99, X重量: 20, X购买产品: []string{"西瓜", "香蕉", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}}
	result, _ := cli.X插入(ctx, userInfo)
	fmt.Println(result.X插入ID)
}

func Test_插入多条数据(t *testing.T) {
	var userInfos = []X记账{
		{X姓名: "张三", X名称: "a1", X年龄: 99, X重量: 20, X购买产品: []string{"西瓜", "香蕉", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "张三", X名称: "b2", X年龄: 6, X重量: 25, X购买产品: []string{"西瓜", "香蕉", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "张三", X名称: "c3", X年龄: 6, X重量: 30, X购买产品: []string{"西瓜", "香蕉", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "张三", X名称: "d4", X年龄: 6, X重量: 35, X购买产品: []string{"玉米", "番茄", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "张三", X名称: "a1", X年龄: 7, X重量: 40, X购买产品: []string{"玉米", "番茄", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "微信", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "李四", X名称: "a1", X年龄: 8, X重量: 45, X购买产品: []string{"玉米", "番茄", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "177777777", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "李四", X名称: "d4", X年龄: 6, X重量: 35, X购买产品: []string{"玉米", "番茄", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "188888888", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "李四", X名称: "a1", X年龄: 3, X重量: 40, X购买产品: []string{"玉米", "番茄", "老虎钳"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "188888888", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "李四", X名称: "a1", X年龄: 33, X重量: 45, X购买产品: []string{"玉米", "香蕉", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "微信", X联系方式: "188888888", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "李四", X名称: "d4", X年龄: 33, X重量: 35, X购买产品: []string{"西瓜", "香蕉", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "微信", X联系方式: "133333333", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "王五", X名称: "a1", X年龄: 22, X重量: 40, X购买产品: []string{"西瓜", "香蕉", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "微信", X联系方式: "133333333", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "王五", X名称: "a1", X年龄: 22, X重量: 45, X购买产品: []string{"西瓜", "香蕉", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "微信", X联系方式: "133333333", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "王五", X名称: "d4", X年龄: 2, X重量: 35, X购买产品: []string{"西瓜", "香蕉", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "微信", X联系方式: "133333333", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "王五", X年龄: 7, X重量: 40, X购买产品: []string{"西瓜", "番茄", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "188888888", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
		{X姓名: "王五", X名称: "", X年龄: 8, X重量: 45, X购买产品: []string{"西瓜", "番茄", "草鱼"}, X购买时间: time.Now(), X支付方式: X支付方式{
			X支付方式: "支付宝", X联系方式: "188888888", X可选支付方式: []string{"支付宝", "微信", "银行卡"},
		}},
	}
	result, err := cli.Collection.X插入多个(ctx, userInfos)
	fmt.Println(result.X插入IDs)
	fmt.Println(err)
}
